# GetAffectedElements Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
GlobalParameter..::..GetAffectedElements Method
GlobalParameter Class See Also
---
Returns all elements of which properties are driven by this global parameter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016 Subscription Update
# Syntax
C#
---
```text
public ISet<ElementId> GetAffectedElements()
```

Visual Basic
---
```text
Public Function GetAffectedElements As ISet(Of ElementId)
```

Visual C++
---
```text
public:
ISet<ElementId^>^ GetAffectedElements()
```

# ### Return Value
Collection of Element Ids.
# Remarks
The returned collection does not include dimensions labeled by this global parameter. To get the labeled dimensions use the GetLabeledDimensions()()()() method. Other global parameters that may be affected by this one (in their formulas) are also excluded from the returned collection. To get the set of affected global parameters use the GetAffectedGlobalParameters()()()() method.
# See Also
GlobalParameter Class
Autodesk.Revit.DB Namespace